function getHelp(Key)

if Key == "HelpList" then
	HelpList = [[
> لیست راهنمای ربات التراگرند 😐💪 :

> `راهنمای قفل`

 > `راهنمای مدیریتی`

> `راهنمای فان`


> برای دریافت هر راهنمو عبارت آن را تایپ کنید .
برای مثال : `راهنمای قفل`
]]
	return HelpList
	
elseif Key == "LocksHelp" then
	LocksHelp = [[
>️ راهنمای قفل ها

`قفل لینک`
`بازکردن لینک`
> فعال و غیرفعال کردن قفل لینک
ــــــــــــــــــــــــــــ
`قفل سنجاق`
`بازکردن سنجاق`
> فعال و غیرفعال کردن قفل سنجاق
ــــــــــــــــــــــــــــ
`قفل ادیت`
`بازکردن ادیت`
> فعال و غیرفعال کردن قفل ادیت(ویرایش) پیام
ــــــــــــــــــــــــــــ
`قفل فروارد`
`بازکردن فروارد`
> فعال و غیرفعال کردن قفل فروارد پیامها
ــــــــــــــــــــــــــــ
`قفل کیبورد اینلاین`
`بازکردن کیبورد اینلاین`
> فعال و غیرفعال کردن قفل کیبورد شیشه ای
ــــــــــــــــــــــــــــ
`قفل اسپم`
`بازکردن اسپم`
> فعال و غیرفعال کردن قفل پیام های طولانی
ــــــــــــــــــــــــــــ
`قفل ربات`
`بازکردن ربات`
> فعال و غیرفعال کردن قفل ورود و استفاده از ربات های API ، ربات به محض ورود اخراج میگردد.
ــــــــــــــــــــــــــــ
`قفل رگباری`
`بازکردن رگباری`
> فعال و غیرفعال کردن اخراج کاربر در صورت ارسال پیام در گروه بصورت رگباری
ــــــــــــــــــــــــــــ
`قفل سرویس تلگرام`
`بازکردن سرویس تلگرام`
> فعال و غیرفعال کردن حذف پیام های ورود و خروج
ــــــــــــــــــــــــــــ
`قفل انگلیسی`
`بازکردن انگلیسی`
> فعال و غیرفعال کردن قفل انگلیسی
ــــــــــــــــــــــــــــ
`قفل فارسی`
`بازکردن فارسی`
> فعال و غیر فعال کردن قفل فارسی
ــــــــــــــــــــــــــــ
`قفل یوزرنیم`
`بازکردن یوزرنیم`
> فعال و غیرفعال کردن قفل یوزرنیم (@)
ــــــــــــــــــــــــــــ
`قفل تگ`
`بازکردن تگ`
> فعال و غیرفعال کردن قفل تگ (#)
ــــــــــــــــــــــــــــ
`قفل متن`
`بازکردن متن`
> فعال و غیرفعال کردن قفل ارسال متن
ــــــــــــــــــــــــــــ
`قفل استیکر`
`بازکردن استیکر`
> فعال و غیرفعال کردن قفل استیکر
ــــــــــــــــــــــــــــ
`قفل اهنگ`
`بازکردن اهنگ`
> فعال و غیرفعال کردن قفل اهنگ
ــــــــــــــــــــــــــــ
`قفل ویس`
`بازکردن ویس`
> فعال و غیرفعال کردن قفل ویس
ــــــــــــــــــــــــــــ
`قفل عکس`
`بازکردن عکس`
> فعال و غیرفعال کردن قفل عکس
ــــــــــــــــــــــــــــ
قفل فیلم
بازکردن فیلم 
> فعال و غیرفعال کردن قفل فیلم 
ــــــــــــــــــــــــــــ
قفل فیلم سلفی
بازکردن فیلم سلفی
> فعال و غیرفعال کردن قفل فیلم سلفی
ــــــــــــــــــــــــــــ
قفل فایل
بازکردن فایل
> فعال و غیرفعال کردن قفل فایل(file)
ــــــــــــــــــــــــــــ
`قفل مخاطب`
`بازکردن مخاطب`
> فعال و غیرفعال کردن قفل ارسال مخاطب
ــــــــــــــــــــــــــــ
قفل گروه
بازکردن گرو
> فعال و غیرفعال کردن قفل گرچه (اگر این قفل فعال باشد هر گونه مطلب ارسالی در گروه توسط کاربران عادی ، حذف خواهد شد.)
ــــــــــــــــــــــــــــ
خوش اومد گویی فعال
خوش اومد گویی غیرفعال
> فعال و غیرفعال کردن خوشامد گویی به کاربران تازه وارد به گروه
ــــــــــــــــــــــــــــ
تنظیمات
>️ دریافت تنظیمات گروه (نمایش وضعیت فقل ها و تاریخ انقضای گروه)
ــــــــــــــــــــــــــــ
]]
	return LocksHelp

elseif Key == "FunHelp" then
	FunHelp = [[
>️ راهنمای فان :

زمان
/time
> دریافت زمان و تاریخ شمسی و میلادی
ــــــــــــــــــــــــــــ
تاریخ
/date
> دریافت اطلاعات کاملی از تاریخ شمسی
ــــــــــــــــــــــــــــ
ترجمه (متن)
/tr (word)
> ترجمه متن انگلیسی به فارسی
ــــــــــــــــــــــــــــ
طراحی (متن)
/beauty (word)
> طراحی متن با بیش از 100 فونت
`توضیح : به جای (متن) ، عبارت مورد نظر خودتونو برای زیباسازی بنویسید.`
ــــــــــــــــــــــــــــ
هوا (شهر)
/weather (city)
> دریافت آب و هوای شهر مورد نظر
```توضیح : بجای (شهر) ، نام شهر مورد نظر خود را به انگلیسی بنوسید. برای مثال : ```
> `هوا tehran`
ــــــــــــــــــــــــــــ
]]
	return FunHelp

elseif Key == "ModerationHelp" then
	ModerationHelp = [[
> راهنمای مدیریتی گروه

ایدی (یوزرنیم/ریپلای/آیدی)
/id (Username/Reply/ID)
> دریافت اطلاعات یک شخص
ــــــــــــــــــــــــــــ
مشخصات (آیدی)
/whois (ID)
> دریافت اطلاعات یک شخص
ــــــــــــــــــــــــــــ
اطلاعات گروه
/gpinfo
> دریافت اطلاعات گروه
ــــــــــــــــــــــــــــ
پین (ریپلای)
/pin (Reply)
> پین کردن پیام در گروه

آنپین
/unpin
> آنپین کردن پیام پین شده
ــــــــــــــــــــــــــــ
اخراج (یوزرنیم/ایدی/ریپلای)
/kick (Username/ID/Reply)
> اخراج یک کاربر از گروه
ــــــــــــــــــــــــــــ
ریپورت (ریپلای)
/report (Reply)
> ریپورت کردن یک کاربر
ــــــــــــــــــــــــــــ
بن (یوزرنیم/ایدی/ریپلای)
/ban (Username/Reply/ID)
> بن کردن یک کاربر از گروه
ــــــــــــــــــــــــــــ
انبن (یوزرنیم/ایدی/ریپلای)
/unban (Username/Reply/ID)
> انبن کردن یک کاربر در گروه
ــــــــــــــــــــــــــــ
لیست بن 
/mutelist
> دریافت لیست افراد بن شده از گروه
ــــــــــــــــــــــــــــ
پاکسازی لیست بن
/clean banlist
> خالی کردن لیست افرادی که از گروه بن شده اند.
ــــــــــــــــــــــــــــ
بی صدا (یوزرنیم/ایدی/ریپلای)
/mute (Username/Reply/ID)
> بی صدا کردن یک کاربر از گروه
ــــــــــــــــــــــــــــ
با صدا (یوزرنیم/ایدی/ریپلای)
/unmute (Username/Reply/ID)
> با صدا کردن یک کاربر در گروه
ــــــــــــــــــــــــــــ
لیست بی صدا
/mutelist
> دریافت لیست افراد بی صدا در گروه
ــــــــــــــــــــــــــــ
پاکسازی لیست بی صدا
/clean mutelist
> خالی کردن لیست افرادی که در گروه بی صدا شده اند.
ــــــــــــــــــــــــــــ
تنظیم ناظر (یوزرنیم/ریپلای/آیدی)
/promote (Username/Reply/ID)
> تنظیم یک کاربر به عنوان ناظر گروه در ربات (مخصوص مدیر)
ــــــــــــــــــــــــــــ
حذف ناظر (یوزرنیم/ریپلای/آیدی)
/demote (Username/Reply/ID)
> حذف یک کاربر به عنوان ناظر گروه در ربات (مخصوص مدیر)
ــــــــــــــــــــــــــــ
لیست مدیران فرعی
/modlist
> دریافت لیست مدیران فرعی ربات در گروه
ــــــــــــــــــــــــــــ
پاکسازی لیست مدیران فرعی
/clean modlist
> پاکسازی لیست مدیران فرعی ربات در گروه
ــــــــــــــــــــــــــــ
تنظیم لینک
/setlink
> تنظیم لینک گروه برای ربات
ــــــــــــــــــــــــــــ
لینک
/link
> دریافت لینک تنظیم شده گروه
ــــــــــــــــــــــــــــ
پاکسازی لینک
/clean link
> حذف لینک تنظیم شده گروه
ــــــــــــــــــــــــــــ
پینگ
/ping
> دریافت اطلاعات ربات و وضعیت آنلاینی
ــــــــــــــــــــــــــــ
فیلتر (عبارت)
/filter (word)
> فیلتر کردن یک کلمه در گروه
`توضیح : برای فیلتر کردن عبارت دلخواه کافی است تا به جای (عبارت) ، کلمه و یا عبارت مورد نظر خود را قرار دهید `

رفع فیلتر (عبارت)
/rw (word)
> رفع فیلتر کردن یک کلمه در گروه
`توضیح : برای رفع فیلتر کردن عبارت دلخواه کافی است تا به جای (عبارت) ، عبارت و یا کلمه مورد نظر خود را قرار دهید. `

لیست فیلتر
/filterlist
> دریافت لیست عبارات فیلتر شده در گروه

پاکسازی لیست فیلتر
/clean filterlist
> رفع فیلتر کردن تمام کلمات فیلتر شده (مخصوص مدیر اصلی)
ــــــــــــــــــــــــــــ
`تنظیم رگباری` (عدد)
> برای تنظیم حساسیت پیام رگباری کافیست به جای (عددقرار دهید.
ــــــــــــــــــــــــــــ
حذف (ریپلای)
/del (Reply)
> حذف یک پیام در گروه با ریپلای
ــــــــــــــــــــــــــــ
حذف (عدد)
/rmsg (num)
> حذف آخرین چت های ارسالی در گروه
`توضیح : برای پاک کردن آخرین پیام های گروه کافیست به جای (عدد) ، یکی از اعداد 1تا100 را قرار دهید. `
ــــــــــــــــــــــــــــ
حذف همه
/clean msg
> پاکسازی آخرین چت های ارسالی در گروه تا حد ممکن و تعداد بالا
ــــــــــــــــــــــــــــ
پاکسازی ربات ها
/clean bots
> اخراج تمامی ربات های معمولی(API) در موجود در گروه
ــــــــــــــــــــــــــــ
پاکسازی حذف شده
/clean deleted
> اخراج تمامی کاربران Deleted Account از گروه
ــــــــــــــــــــــــــــ
مقام من
/myrank
> دریافت مقام خود در ربات
ــــــــــــــــــــــــــــ
تنظیم قوانین (متن)
/setrules (word)
> تنظیم قوانین گروه (به جای `(متن)` ، متن قوانین خود را بنویسید.)

قوانین
/rules
> دریافت قوانین تنظیم شده.
ــــــــــــــــــــــــــــ
پاکسازی قوانین
/clean rules
> حذف متن تنظیم شده برای قوانین گروه
ــــــــــــــــــــــــــــ
پاکسازی لیست بلاک
/clean blocklist
> خالی کردن لیست بلاکی های گروه و ادد کردن آنها به گروه
ــــــــــــــــــــــــــــ
]]
	return ModerationHelp
end

end